{
    "ADBE Additive Dissolve": "A bright, glowing fade that adds the color intensity of both clips together, creating a dreamy or washed-out light effect.",
    "ADBE Band Slide": "Reveals the incoming clip using sliding rectangular bands, creating a geometric and structured transition.",
    "ADBE Band Wipe": "Wipes between clips using moving bars, offering a structured, blinds-like reveal.",
    "ADBE CheckerBoard": "Reveals the next clip through a grid of alternating squares, creating a retro or puzzle-like pattern.",
    "ADBE Checker Wipe": "A wipe effect using a moving grid of checkerboard squares.",
    "ADBE Cross Zoom": "A high-speed zoom into the first clip and out of the second, creating a fast, energetic, and seamless warp effect.",
    "ADBE Film Dissolve": "A classic, realistic fade that blends clips in a linear color space, mimicking the optical dissolve of actual film.",
    "ADBE Iris Cross": "A transition where the new clip appears inside a cross shape that expands outward.",
    "ADBE Iris Diamond": "A transition where the new clip is revealed through an expanding diamond shape.",
    "ADBE Iris Round": "A classic circle opening transition, reminiscent of silent films or cartoons.",
    "ADBE Iris Square": "A transition where the new clip is revealed through an expanding square box.",
    "ADBE Page Turn": "Simulates a physical page peeling from the corner to reveal the next clip, evoking a storybook or chapter change.",
    "ADBE Paint Splatter": "Reveals the next clip through an organic, ink-blot or paint-splatter shaped matte.",
    "ADBE Pinwheel": "Wipes between clips using rotating triangular sections, resembling a spinning pinwheel.",
    "ADBE Push": "The incoming clip physically pushes the outgoing clip off-screen, indicating directional travel or temporal progression.",
    "ADBE Random Blocks": "Reveals the new clip through a randomized grid of disappearing blocks, creating a digitized or pixelated effect.",
    "ADBE Random Wipe": "A wipe that reveals the new clip using a randomized, noisy pattern.",
    "ADBE Slide": "The incoming clip slides over the top of the outgoing clip, like a physical photo being placed on top.",
    "ADBE Spiral Boxes": "A complex geometric wipe where boxes spiral inward or outward to reveal the new image.",
    "ADBE Venetian Blinds": "Simulates opening blinds with horizontal or vertical slats to reveal the underlying clip.",
    "ADBE Wedge Wipe": "Wipes the screen using a rotating wedge shape, similar to a clock hand or radar sweep.",
    "ADBE Wipe": "A simple, hard-edged line travels across the screen to replace one clip with another.",
    "ADBE Zig-Zag Blocks": "Reveals the image in a stepped, diagonal zig-zag pattern.",
    "AE.Mettle SkyBox Chroma Leaks": "Overlays colorful, spectrum-based light leaks, creating a psychedelic or holographic vibe.",
    "AE.Mettle SkyBox Light Leaks": "Simulates organic light entering a camera lens, adding warmth, vintage flair, or a dreamy atmosphere.",
    "AE.Mettle SkyBox Random Blocks": "A VR-optimized transition that swaps scenes using randomized blocky patterns.",
    "AE.ADBE MorphCut": "An AI-powered transition that blends face movements to hide jump cuts in interviews, making the edit appear continuous.",
    "AE.Mettle SkyBox Rays": "Projects volumetric light rays from the bright parts of the image to transition between scenes.",
    "AE.Mettle SkyBox Gradient Wipe": "Uses a softness gradient to melt one scene into another, often used for 360 or immersive footage.",
    "AE.Mettle SkyBox Mobius Zoom": "A trippy, twisting zoom effect that folds the image in on itself.",
    "AE.Mettle SkyBox Iris Wipe": "A circular reveal optimized for spherical or 360-degree footage.",
    "AE.Mettle SkyBox Radial Blur": "Applies a heavy circular blur to mask the cut, adding rotational energy.",
    "AE.ADBE Dip To Black": "Fades the first clip to complete black before fading in the second, signifying a scene change, passage of time, or finality.",
    "AE.ADBE Non-Additive Dissolve": "A dissolve that maps luminance values to prevent brightness spikes, resulting in a darker, subtler blend than a standard dissolve.",
    "AE.ADBE Split": "The screen splits in half (horizontally or vertically) to reveal the next clip underneath.",
    "AE.ADBE Barn Doors": "Simulates two doors opening or closing from the center, revealing the new clip.",
    "AE.ADBE Dip To White": "Fades the clip to pure white before revealing the next, creating a flashbulb effect, dream sequence start, or high-key transition.",
    "AE.ADBE Inset": "The new clip enters as a smaller picture-in-picture box and zooms to full screen.",
    "AE.ADBE Whip": "A fast, directional blur simulating a camera whipping quickly to the side, useful for high-energy action edits.",
    "AE.ADBE Cross Dissolve New": "The standard video transition; a smooth, gradual blend from one clip to the next.",
    "AE.ADBE Radial Wipe": "A wipe that rotates around a center point, like a clock hand sweeping the screen.",
    "AE.ADBE Center Split": "The image divides from the center and moves outwards to reveal the incoming footage.",
    "AE.ADBE Clock Wipe": "A circular wipe that moves in a clockwise direction, strongly signifying the passage of time.",
    "AE.AE_Impact_3D_Blinds": "A 3D effect where the image rotates like vertical blinds to show the B-side.",
    "AE.AE_Impact_3D_Block": "The video breaks into 3D blocks that rotate or tumble to reveal the next shot.",
    "AE.AE_Impact_3D_Flip": "The entire frame flips on a 3D axis like a card turning over.",
    "AE.AE_Impact_3D_Roll": "The footage rolls off the screen like a rolling pin or cylindrical scroll.",
    "AE.AE_Impact_3D_Rotate": "The screen spins on a 3D axis, adding depth and perspective to the cut.",
    "AE.Impact_Additive_Dissolve": "A boosted version of the additive dissolve with more control over the glow and brightness intensity.",
    "AE.AE_Impact_Blur_dissolve": "Combines a fade with a blur, softening the image details during the transition for a dreamy or foggy look.",
    "AE.AE_Impact_Burn_Alpha": "Burns through the alpha channel, eroding the image like acid or fire.",
    "AE.AE_Impact_Burn_White": "Simulates a film strip burning up due to heat, transitioning with a bright, organic white-hot edge.",
    "AE.AE_Impact_C-Push": "A chromatic aberration push, where color channels split (RGB split) during the movement for a modern, edgy look.",
    "AE.AE_Impact_Chaos": "Rapid, frantic displacement and glitching, perfect for horror, tension, or disorienting effects.",
    "AE.AE_Impact_Chroma_Leaks": "A stylized light leak that emphasizes RGB color separation and spectrum artifacts.",
    "AE.AE_Impact_Clock_Wipe": "A polished version of the standard clock wipe with added smoothing and edge controls.",
    "AE.AE_Impact_Dissolve": "A highly customizable cross-dissolve with options for easing and curve adjustments.",
    "AE.Impact_Cross_Zoom": "A dynamic zoom-blur transition that propels the viewer into the next scene with high velocity.",
    "AE.AE_Impact_Dip_To_Black": "A customizable fade-to-black with control over the curve, allowing for sudden drops or lingering darkness.",
    "AE.AE_Impact_Blur_To_Color": "Blurs the image completely into a solid color before resolving into the new clip.",
    "AE.AE_Impact_Dip_To_White": "A customizable flash-to-white, useful for fashion, music videos, or flashbacks.",
    "AE.AE_Impact_Directional_Blur": "Streaks the image in a specific direction (up, down, left, right) to simulate fast motion.",
    "AE.AE_Impact_Earthquake": "Violently shakes the camera frame, simulating an impact, explosion, or seismic event.",
    "AE.Impact_Film_Dissolve": "Emulates the exposure characteristics of analog film stock for a cinematic blending of scenes.",
    "AE.AE_Impact_Film_Roll": "Simulates a film projector slipping vertically, rolling the frame up or down.",
    "AE.AE_Impact_Flare": "Transitions using a bright, anamorphic or spherical lens flare that washes over the screen.",
    "AE.AE_Impact_Flash": "A sudden, intense burst of light, brighter and sharper than a standard dip-to-white.",
    "AE.AE_Impact_Flicker": "Rapidly toggles brightness or opacity, simulating a strobing light or broken projector.",
    "AE.AE_Impact_Fold": "The image folds in on itself like a piece of paper or origami.",
    "AE.AE_Impact_Frame": "Dynamic framing elements slide in or out to transition the scene.",
    "AE.AE_Impact_Glass": "Distorts the image as if viewed through moving, refracting glass or crystal.",
    "AE.AE_Impact_Glitch": "Simulates digital data corruption, pixel sorting, and compression errors for a sci-fi or tech-fail vibe.",
    "AE.AE_Impact_Glow": "The highlights of the image bloom and glow intensely to transition to the next shot.",
    "AE.AE_Impact_Grunge": "Adds dirt, scratches, and texture to the transition for a gritty, urban, or industrial look.",
    "AE.AE_Impact_Kaleido": "Reflects the image into a symmetrical, kaleidoscopic pattern.",
    "AE.AE_Impact_Lens_Blur": "Simulates a camera racking focus, blurring the background to bokeh before sharpening on the new clip.",
    "AE.AE_Impact_Light_Leaks": "Adds organic, moving patches of colored light, simulating light hitting the camera sensor.",
    "AE.AE_Impact_Light_Sweep": "A beam of light sweeps across the frame, wiping the new image on.",
    "AE.AE_Impact_Linear_Wipe": "A clean, smooth wipe with soft edges, often used for professional presentations.",
    "AE.AE_Impact_Liquid_Distortion": "Warps the image as if it were a fluid, creating a melting or underwater transition effect.",
    "AE.AE_Impact_Luma_Fade": "Transitions based on the brightness of the image pixels, with brights or darks fading first.",
    "AE.AE_Impact_Mirror": "Splits and reflects the screen to reveal the next shot.",
    "AE.AE_Impact_Mosaic": "Pixelates the image into large blocks that resolve into the new clip.",
    "AE.AE_Impact_Warp": "Bends and twists the image geometry to pull the viewer into the next scene.",
    "AE.AE_Impact_Animate": "Uses animation curves to move elements of the clip during the transition.",
    "AE.AE_Impact_Copy_Machine": "Simulates the scanning light of a photocopier passing over the image.",
    "AE.AE_Impact_Page_Peel": "A high-quality 3D page turn effect with lighting and shadow controls.",
    "AE.AE_Impact_PanelWipe": "Multiple panels slide across the screen to replace the image.",
    "AE.AE_Impact_Phosphore": "Simulates the delay and glow of an old CRT monitor or phosphor screen.",
    "AE.AE_Impact_Plateau_Wipe": "A wipe that uses a gradient map to create a stepped or plateaued reveal.",
    "AE.AE_Impact_Pop": "The new clip pops onto the screen with a slight bounce or elastic scale effect.",
    "AE.AE_Impact_Pull": "Pulls the outgoing clip backward into Z-space to reveal the new clip.",
    "AE.AE_Impact_Push": "Pushes the old clip out of the way using the new clip, with added motion blur.",
    "AE.AE_Impact_Radial_Blur": "Apply a strong spinning blur to the transition point.",
    "AE.Impact_Radial_Wipe": "A circular wipe with customizable feathering and center points.",
    "AE.AE_Impact_Rays": "God-rays or volumetric light beams shoot out from the image highlights.",
    "AE.AE_Impact_Roll": "Rolls the image continuously in a direction, creating a conveyor belt effect.",
    "AE.AE_Impact_Shape_Flow": "Morphs the image using geometric shapes that flow into one another.",
    "AE.AE_Impact_Slice": "Slices the image into strips that slide apart.",
    "AE.AE_Impact_Solarize": "Inverts color and luminance values briefly, creating a trippy, photographic negative look.",
    "AE.AE_Impact_Spin": "Rapidly spins the camera 360 degrees to land on the new clip.",
    "AE.AE_Impact_Split": "Splits the image and separates the pieces to show the underlying layer.",
    "AE.AE_Impact_Spring": "A transition with elastic, bouncy movement physics.",
    "AE.AE_Impact_Star_Wipe": "A retro wipe using a star shape.",
    "AE.AE_Impact_Stretch_Wipe": "Stretches the pixels at the edge of the wipe, creating a smear effect.",
    "AE.AE_Impact_Stretch": "Distorts and pulls the image horizontally or vertically like rubber.",
    "AE.AE_Impact_Stripes": "Overlays animating stripes that reveal the second clip.",
    "AE.AE_Impact_TV_Power": "Simulates an old television set turning off, shrinking the image to a dot.",
    "AE.AE_Impact_Text_Animator": "Transitions designed to work specifically with text overlays.",
    "AE.AE_Impact_Typewriter": "Reveals elements sequentially, similar to typing.",
    "AE.AE_Impact_VHS_Damage": "Adds tracking errors, static, and color bleeding to mimic a broken VCR tape.",
    "AE.AE_Impact_Wave": "Ripples the image like a stone thrown into a pond.",
    "AE.Impact_Whip": "A high-velocity lateral blur that mimics a fast camera pan.",
    "AE.AE_Impact_Wipe": "A standard wipe improved with better edge softness and angle controls.",
    "AE.AE_Impact_Zoom_Blur": "Blurs the edges of the frame outward, simulating a rapid speed change."
}